InformationRegisters/А_ИдентификацияВизирующихПоРолям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>А_ИдентификацияВизирующихПоРолям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Переадресация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереадресацияС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереадресацияДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переадресант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.А_РолиВизирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/А_ОпределениеСхемыВизирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>А_ОпределениеСхемыВизирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СхемаВизирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.А_СхемыВизирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/А_Визы_Состояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>А_Визы_Состояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВизировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденСКомментариями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Анулировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложеноСКомментарием</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗаказовПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовПоставщикам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьКПоступлению</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/А_ВидыАдресацииРолейВизирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>А_ВидыАдресацииРолейВизирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПодразделению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНаправлению</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/А_РолиВизирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>А_РолиВизирования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАдресации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.А_ВидыАдресацииРолейВизирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТекущаяДолжность</Name>
					<Comment>использовался в УТдУ31</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/А_СхемыВизирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>А_СхемыВизирования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.А_РолиВизирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/А_ВизированиеСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Устанавливает состояние визы документа.
//
// КОНТРАКТ ЗАПИСИ: процедура документ НЕ ПИШЕТ. Она только меняет объект в памяти
// (реквизиты А_Виза_*, ТЧ А_Визы / А_ТекущиеВизирующие / А_ПредварительныеВизы и — через типовой
// ДокОбъект.УстановитьСтатус() — реквизит Статус) и возвращает результат.
// Запись выполняет вызывающий. Это в точности контракт типового
// ОбщегоНазначенияУТВызовСервера.УстановитьСтатусДокументов (:110 меняет, :116 пишет).
//
// Параметры:
//  ДокОбъект  - ДокументОбъект.ЗаказПоставщику
//  Состояние  - ПеречислениеСсылка.А_Визы_Состояния - целевое состояние.
//               Пустая ссылка = предварительная ("отложенная") виза.
//  ДопПараметры - Структура (все ключи опциональны):
//               * ТекущийПользователь - СправочникСсылка.Пользователи
//               * ЭтоАвтоВиза  - Булево - виза поставлена автоматически (пишется в А_Визы.Авто)
//               * ЭтоИзФормы   - Булево - тумблер предварительной визы
//               * ДатаВизы     - Дата
//               * Виза_Причина - Строка
//               * СхемаВизирования - СправочникСсылка.А_СхемыВизирования - принудительная схема
//
// Возвращаемое значение:
//  Структура - Успех (Булево), ТекстОшибки (Строка). Исключений не бросает.
//
Функция УстановитьСостояние(ДокОбъект, Состояние, ДопПараметры = Неопределено) Экспорт

	Результат = Новый Структура("Успех, ТекстОшибки", Истина, "");

	Допы = ?(ДопПараметры = Неопределено, Новый Структура, ДопПараметры);

	ТекПользователь = Неопределено;
	Если НЕ Допы.Свойство("ТекущийПользователь", ТекПользователь) ИЛИ НЕ ЗначениеЗаполнено(ТекПользователь) Тогда
		ТекПользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;

	ЭтоАвтоВиза = Ложь;
	Допы.Свойство("ЭтоАвтоВиза", ЭтоАвтоВиза);

	ЭтоИзФормы = Ложь;
	Допы.Свойство("ЭтоИзФормы", ЭтоИзФормы);

	ДатаВизы = Неопределено;
	Если НЕ Допы.Свойство("ДатаВизы", ДатаВизы) ИЛИ НЕ ЗначениеЗаполнено(ДатаВизы) Тогда
		ДатаВизы = ТекущаяДатаСеанса();
	КонецЕсли;

	ВизаПричина = "";
	Допы.Свойство("Виза_Причина", ВизаПричина);

	// Документ вне контура визирования (обменный или исторический) визировать нельзя.
	Если НЕ ЗначениеЗаполнено(ДокОбъект.А_Виза_Состояние) Тогда
		Результат.Успех = Ложь;
		Результат.ТекстОшибки = НСтр("ru='Заказ вне контура визирования (создан обменом).'");
		Возврат Результат;
	КонецЕсли;

	НужныВизы  = Ложь;
	НужныПольз = Ложь;

	Если Состояние = Перечисления.А_Визы_Состояния.Черновик Тогда

		ДокОбъект.А_Визы.Очистить();
		ДокОбъект.А_Виза_Состояние   = Перечисления.А_Визы_Состояния.Черновик;
		ДокОбъект.А_Виза_ТекущаяРоль = Справочники.А_РолиВизирования.Инициатор;
		НужныПольз = Истина;

	ИначеЕсли Состояние = Перечисления.А_Визы_Состояния.Утвержден
		ИЛИ Состояние = Перечисления.А_Визы_Состояния.УтвержденСКомментариями
		ИЛИ Состояние = Перечисления.А_Визы_Состояния.Отклонено Тогда

		// Маршрут строится один раз — при первом утверждении инициатором.
		НужныВизы  = (ДокОбъект.А_Виза_Состояние <> Перечисления.А_Визы_Состояния.НаВизировании);
		НужныПольз = Истина;

	ИначеЕсли Состояние = Перечисления.А_Визы_Состояния.ПустаяСсылка() Тогда

		// Предварительная ("отложенная") виза — подпись до наступления своей очереди.
		Возврат УстановитьПредварительнуюВизу(ДокОбъект, ТекПользователь, ЭтоИзФормы, ВизаПричина);

	Иначе // Анулировано

		НужныПольз = Истина;

	КонецЕсли;

	// --- Построение маршрута -------------------------------------------------
	Если НужныВизы Тогда

		Схема = Неопределено;
		Допы.Свойство("СхемаВизирования", Схема);

		Если ЗначениеЗаполнено(ДокОбъект.А_ПриоритетнаяСхемаВизирования) Тогда
			Схема = ДокОбъект.А_ПриоритетнаяСхемаВизирования;
		ИначеЕсли НЕ ЗначениеЗаполнено(Схема) Тогда
			Схема = ПолучитьСхемуВизирования(ДокОбъект);
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Схема) Тогда
			Результат.Успех = Ложь;
			Результат.ТекстОшибки = НСтр("ru='Не определена схема визирования для этого заказа.'");
			Возврат Результат;
		КонецЕсли;

		МассивРолей = ПолучитьМассивРолейПоСхеме(Схема);
		Если МассивРолей.Количество() = 0 Тогда
			Результат.Успех = Ложь;
			Результат.ТекстОшибки = НСтр("ru='В схеме визирования не задано ни одной роли.'");
			Возврат Результат;
		КонецЕсли;

		ДокОбъект.А_Визы.Очистить();
		Для Каждого Роль Из МассивРолей Цикл
			ДокОбъект.А_Визы.Добавить().Роль = Роль;
		КонецЦикла;

		ДокОбъект.А_ТекущиеВизирующие.Очистить();

		ЗаполнитьПредварительныеВизы(ДокОбъект, МассивРолей);

	КонецЕсли;

	// --- Штампуем текущую визу ------------------------------------------------
	ТекРоль = ДокОбъект.А_Виза_ТекущаяРоль;
	Если НЕ ЗначениеЗаполнено(ТекРоль)
		И (ДокОбъект.Менеджер = ТекПользователь ИЛИ ДокОбъект.Автор = ТекПользователь) Тогда
		ТекРоль = Справочники.А_РолиВизирования.Инициатор;
	КонецЕсли;

	НайденныеСтроки = ДокОбъект.А_Визы.НайтиСтроки(Новый Структура("Роль", ДокОбъект.А_Виза_ТекущаяРоль));

	Если ТекРоль = Справочники.А_РолиВизирования.Инициатор
		И НайденныеСтроки.Количество() = 0
		И ДокОбъект.А_Визы.Количество() > 0 Тогда
		// Инициатор становится первой строкой истории.
		СтрокаВизы = ДокОбъект.А_Визы.Вставить(0);
	ИначеЕсли НайденныеСтроки.Количество() = 0 Тогда
		СтрокаВизы = ДокОбъект.А_Визы.Добавить();
	Иначе
		СтрокаВизы = НайденныеСтроки[0];
	КонецЕсли;

	СтрокаВизы.Роль           = ТекРоль;
	СтрокаВизы.Пользователь   = ТекПользователь;
	СтрокаВизы.ДатаВизы       = ДатаВизы;
	СтрокаВизы.Виза_Состояние = Состояние;
	СтрокаВизы.Авто           = ЭтоАвтоВиза;
	СтрокаВизы.Комментарий    = ВизаПричина;

	ДокОбъект.А_Виза_Дата = ТекущаяДатаСеанса();
	// Пишем явно: из-за префикса А_ имена не совпадают с ключами структуры,
	// поэтому ЗаполнитьЗначенияСвойств(ДокОбъект, Допы) здесь молча НЕ сработала бы.
	Если НЕ ПустаяСтрока(ВизаПричина) Тогда
		ДокОбъект.А_Виза_Причина = ВизаПричина;
	КонецЕсли;

	// --- Продвижение маршрута -------------------------------------------------
	Если НужныВизы ИЛИ НужныПольз Тогда

		Если Состояние = Перечисления.А_Визы_Состояния.Утвержден
			ИЛИ Состояние = Перечисления.А_Визы_Состояния.УтвержденСКомментариями Тогда

			Результат = ПродвинутьМаршрут(ДокОбъект, Состояние);

		ИначеЕсли Состояние = Перечисления.А_Визы_Состояния.Черновик
			ИЛИ Состояние = Перечисления.А_Визы_Состояния.Отклонено
			ИЛИ Состояние = Перечисления.А_Визы_Состояния.Анулировано Тогда

			ВернутьИнициатору(ДокОбъект, Состояние);

		КонецЕсли;

	КонецЕсли;

	ДокОбъект.А_Виза_ТекущиеВизирующие = ПредставлениеТекущихВизирующих(ДокОбъект);

	Возврат Результат;

КонецФункции

// Возвращает состояния визы, доступные текущему пользователю для документа.
//
// Параметры:
//  ДокСсылка    - ДокументСсылка.ЗаказПоставщику
//  ДопПараметры - Структура - ТекущийПользователь, РольДоступна_ПолныеПрава
//
// Возвращаемое значение:
//  Структура - Состояния (СписокЗначений), ВКонтуре (Булево)
//
Функция ДоступныеСостояния(ДокСсылка, ДопПараметры = Неопределено) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Состояния", Новый СписокЗначений);
	Результат.Вставить("ВКонтуре", Ложь);

	Если НЕ ЗначениеЗаполнено(ДокСсылка) Тогда
		Возврат Результат;
	КонецЕсли;

	Допы = ?(ДопПараметры = Неопределено, Новый Структура, ДопПараметры);

	ТекПользователь = Неопределено;
	Если НЕ Допы.Свойство("ТекущийПользователь", ТекПользователь) ИЛИ НЕ ЗначениеЗаполнено(ТекПользователь) Тогда
		ТекПользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;

	Админ = Ложь;
	Если НЕ Допы.Свойство("РольДоступна_ПолныеПрава", Админ) Тогда
		Админ = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("А_ВизированиеАдминистратор");
	КонецЕсли;

	Данные = ДанныеВизыДокумента(ДокСсылка);
	Если Данные = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Данные.Состояние) Тогда
		// Вне контура визирования.
		Возврат Результат;
	КонецЕсли;

	Результат.ВКонтуре = Истина;

	ЭтоИнициатор = (Данные.Автор = ТекПользователь ИЛИ Данные.Менеджер = ТекПользователь);
	МояОчередь   = (Данные.ТекущиеВизирующие.Найти(ТекПользователь, "Пользователь") <> Неопределено);
	ЕстьПредвиза = (Данные.ПредварительныеВизы.Найти(ТекПользователь, "Пользователь") <> Неопределено);

	Состояние = Данные.Состояние;

	Если Состояние = Перечисления.А_Визы_Состояния.Черновик
		ИЛИ Состояние = Перечисления.А_Визы_Состояния.Отклонено
		ИЛИ Состояние = Перечисления.А_Визы_Состояния.Анулировано Тогда

		Если ЭтоИнициатор ИЛИ Админ Тогда
			ДобавитьСостояние(Результат.Состояния, Перечисления.А_Визы_Состояния.Утвержден, НСтр("ru='Отправить на визирование'"));
			ДобавитьСостояние(Результат.Состояния, Перечисления.А_Визы_Состояния.Анулировано, НСтр("ru='Аннулировать'"));
		КонецЕсли;

	ИначеЕсли Состояние = Перечисления.А_Визы_Состояния.НаВизировании Тогда

		Если МояОчередь ИЛИ Админ Тогда
			ДобавитьСостояние(Результат.Состояния, Перечисления.А_Визы_Состояния.Утвержден, НСтр("ru='Утвердить'"));
			ДобавитьСостояние(Результат.Состояния, Перечисления.А_Визы_Состояния.УтвержденСКомментариями, НСтр("ru='Утвердить (с комментарием)'"));
			ДобавитьСостояние(Результат.Состояния, Перечисления.А_Визы_Состояния.Отклонено, НСтр("ru='Отклонить'"));
		КонецЕсли;

		Если ЭтоИнициатор ИЛИ Админ Тогда
			ДобавитьСостояние(Результат.Состояния, Перечисления.А_Визы_Состояния.Черновик, НСтр("ru='Вернуть в черновик'"));
			ДобавитьСостояние(Результат.Состояния, Перечисления.А_Визы_Состояния.Анулировано, НСтр("ru='Аннулировать'"));
		КонецЕсли;

		Если ЕстьПредвиза И НЕ МояОчередь Тогда
			ДобавитьСостояние(Результат.Состояния, Перечисления.А_Визы_Состояния.ПустаяСсылка(), НСтр("ru='Подписать заранее'"));
		КонецЕсли;

	ИначеЕсли Состояние = Перечисления.А_Визы_Состояния.Утвержден
		ИЛИ Состояние = Перечисления.А_Визы_Состояния.УтвержденСКомментариями Тогда

		Если Админ Тогда
			ДобавитьСостояние(Результат.Состояния, Перечисления.А_Визы_Состояния.Отклонено, НСтр("ru='Отклонить'"));
		КонецЕсли;

	КонецЕсли;

	Возврат Результат;

КонецФункции

// Запрет обхода визирования.
//
// Блокирует ТОЛЬКО повышение до статуса "Подтвержден" — рубежа, на котором заказ вступает в силу
// (появляется ресурс КОформлению в РН.ЗаказыПоставщикам и записи в РН.ТоварыКПоступлению).
// Замерено: статус "Согласован" не даёт ни того, ни другого.
//
// Вызывается из Документ.ЗаказПоставщику.ПередЗаписью СТРОГО ПОСЛЕ проверки ОбменДанными.Загрузка:
// до неё стоит ОбновитьЗаказПоставщикуПослеОбмена (движок обмена BuhBud) и обработчик обновления ИБ.
//
// Параметры:
//  ДокОбъект - ДокументОбъект.ЗаказПоставщику
//  Отказ     - Булево
//
Процедура ПроверитьЗапретОбходаВизирования(ДокОбъект, Отказ) Экспорт

	// 1. Статус ставит сам движок визирования.
	Если ДокОбъект.ДополнительныеСвойства.Свойство("А_ВизаДвижок") Тогда
		Возврат;
	КонецЕсли;

	// 2. ДИСКРИМИНАТОР КОНТУРА.
	// Пустое визовое состояние = документ ВНЕ контура: заказ, приехавший обменом (движок КД 2.0
	// создаёт документ через СоздатьДокумент() и не вызывает Заполнить(), поэтому
	// ОбработкаЗаполнения не срабатывает), либо один из исторических заказов.
	// Благодаря этой проверке миграция исторических данных не требуется.
	Если НЕ ЗначениеЗаполнено(ДокОбъект.А_Виза_Состояние) Тогда
		Возврат;
	КонецЕсли;

	// 3. Блокируем только "Подтвержден". "Закрыт" не блокируем — иначе незавизированный заказ
	// невозможно закрыть. Понижения статуса не блокируем.
	Если ДокОбъект.Статус <> Перечисления.СтатусыЗаказовПоставщикам.Подтвержден Тогда
		Возврат;
	КонецЕсли;

	// 4. Статус этой записью не меняется (перепроведение уже подтверждённого заказа).
	Если ЗначениеЗаполнено(ДокОбъект.Ссылка) Тогда
		СтарыйСтатус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.Ссылка, "Статус");
		Если СтарыйСтатус = ДокОбъект.Статус Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	// 5. Виза пройдена.
	Если ДокОбъект.А_Виза_Состояние = Перечисления.А_Визы_Состояния.Утвержден
		ИЛИ ДокОбъект.А_Виза_Состояние = Перечисления.А_Визы_Состояния.УтвержденСКомментариями Тогда
		Возврат;
	КонецЕсли;

	// 6. Администратор визирования.
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("А_ВизированиеАдминистратор") Тогда
		Возврат;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ru='Заказ не завизирован — статус ""Подтвержден"" недоступен.
			|Отправьте заказ на визирование через рабочее место ""Визирование заказов поставщикам"".'"),
		ДокОбъект.Ссылка,
		"Статус",
		,
		Отказ);

КонецПроцедуры

// Строковое представление текущих визирующих — денормализация для колонки списка.
//
Функция ПредставлениеТекущихВизирующих(ДокОбъект) Экспорт

	Если ДокОбъект.А_Виза_Состояние <> Перечисления.А_Визы_Состояния.НаВизировании Тогда
		Возврат ?(ЗначениеЗаполнено(ДокОбъект.Менеджер), Лев(Строка(ДокОбъект.Менеджер), 250), НСтр("ru='Инициатор'"));
	КонецЕсли;

	Результат = "";
	Для Каждого СтрокаТЧ Из ДокОбъект.А_ТекущиеВизирующие Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + Строка(СтрокаТЧ.Пользователь);
	КонецЦикла;

	// Реквизит объявлен как Строка(250) — обрезаем, чтобы запись не упала.
	Возврат Лев(Результат, 250);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Маршрут

// Продвигает маршрут после утверждения текущей ролью.
// Когда маршрут пройден целиком — переводит заказ в статус "Подтвержден" (рубеж вступления в силу).
//
Функция ПродвинутьМаршрут(ДокОбъект, Состояние)

	Результат = Новый Структура("Успех, ТекстОшибки", Истина, "");

	ДокОбъект.А_Виза_ТекущаяРоль = Справочники.А_РолиВизирования.ПустаяСсылка();
	ДокОбъект.А_ТекущиеВизирующие.Очистить();

	// Первая строка маршрута без проставленного состояния — следующий шаг.
	Для Каждого СтрокаВизы Из ДокОбъект.А_Визы Цикл

		Если ЗначениеЗаполнено(СтрокаВизы.Виза_Состояние) Тогда
			Продолжить;
		КонецЕсли;

		ДокОбъект.А_Виза_ТекущаяРоль = СтрокаВизы.Роль;

		Для Каждого Пользователь Из ПолучитьМассивПользователей(ДокОбъект, СтрокаВизы.Роль) Цикл
			ДокОбъект.А_ТекущиеВизирующие.Добавить().Пользователь = Пользователь;
		КонецЦикла;

		Прервать;

	КонецЦикла;

	Если ЗначениеЗаполнено(ДокОбъект.А_Виза_ТекущаяРоль) Тогда

		// Маршрут не пройден — ждём следующего визирующего.
		ДокОбъект.А_Виза_Состояние = Перечисления.А_Визы_Состояния.НаВизировании;

		Если ДокОбъект.А_ТекущиеВизирующие.Количество() = 0 Тогда
			Результат.Успех = Ложь;
			Результат.ТекстОшибки = СтрШаблон(
				НСтр("ru='Для роли ""%1"" не определён ни один визирующий (регистр ""Идентификация визирующих по ролям"").'"),
				Строка(ДокОбъект.А_Виза_ТекущаяРоль));
			Возврат Результат;
		КонецЕсли;

		// Авто-виза по предварительным подписям.
		ПрименитьПредварительныеВизы(ДокОбъект, Состояние);

		Возврат Результат;

	КонецЕсли;

	// --- Маршрут пройден целиком: заказ вступает в силу -----------------------
	ДокОбъект.А_Виза_Состояние = Состояние;

	ДокОбъект.ДополнительныеСвойства.Вставить("А_ВизаДвижок", Истина);
	Если НЕ ДокОбъект.УстановитьСтатус("Подтвержден", Неопределено) Тогда
		Результат.Успех = Ложь;
		Результат.ТекстОшибки = НСтр("ru='Заказ заполнен не полностью — статус ""Подтвержден"" не установлен.'");
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Возврат мяча инициатору (черновик / отклонение / аннулирование).
// Заказ теряет статус "Подтвержден" — движения КОформлению и ТоварыКПоступлению уходят.
//
Процедура ВернутьИнициатору(ДокОбъект, Состояние)

	ДокОбъект.А_ТекущиеВизирующие.Очистить();

	Инициаторы = Новый Массив;
	Если ЗначениеЗаполнено(ДокОбъект.Менеджер) Тогда
		Инициаторы.Добавить(ДокОбъект.Менеджер);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокОбъект.Автор) И Инициаторы.Найти(ДокОбъект.Автор) = Неопределено Тогда
		Инициаторы.Добавить(ДокОбъект.Автор);
	КонецЕсли;

	Для Каждого Пользователь Из Инициаторы Цикл
		ДокОбъект.А_ТекущиеВизирующие.Добавить().Пользователь = Пользователь;
	КонецЦикла;

	ДокОбъект.А_Виза_Состояние   = Состояние;
	ДокОбъект.А_Виза_ТекущаяРоль = Справочники.А_РолиВизирования.Инициатор;

	Если ДокОбъект.Статус = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден Тогда
		ДокОбъект.ДополнительныеСвойства.Вставить("А_ВизаДвижок", Истина);
		ДокОбъект.УстановитьСтатус("Согласован", Неопределено);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Предварительные (отложенные) визы

Функция УстановитьПредварительнуюВизу(ДокОбъект, ТекПользователь, ЭтоИзФормы, ВизаПричина)

	Результат = Новый Структура("Успех, ТекстОшибки", Истина, "");

	Строки = ДокОбъект.А_ПредварительныеВизы.НайтиСтроки(Новый Структура("Пользователь", ТекПользователь));
	Если Строки.Количество() = 0 Тогда
		Строка = ДокОбъект.А_ПредварительныеВизы.Добавить();
		Строка.Пользователь = ТекПользователь;
	Иначе
		Строка = Строки[0];
	КонецЕсли;

	Строка.Утверждено      = ?(ЭтоИзФормы, НЕ Строка.Утверждено, Истина);
	Строка.ДатаУтверждения = ТекущаяДатаСеанса();
	Строка.Комментарий     = ВизаПричина;

	// Очередь пользователя уже наступила — сразу превращаем предварительную визу в обычную.
	Если Строка.Утверждено
		И ДокОбъект.А_ТекущиеВизирующие.Найти(ТекПользователь, "Пользователь") <> Неопределено Тогда

		Допы = Новый Структура;
		Допы.Вставить("ТекущийПользователь", ТекПользователь);
		Допы.Вставить("ЭтоАвтоВиза", Истина);
		Допы.Вставить("ДатаВизы", Строка.ДатаУтверждения);
		Допы.Вставить("Виза_Причина", Строка.Комментарий);

		Возврат УстановитьСостояние(ДокОбъект, Перечисления.А_Визы_Состояния.Утвержден, Допы);

	КонецЕсли;

	ДокОбъект.А_Виза_ТекущиеВизирующие = ПредставлениеТекущихВизирующих(ДокОбъект);

	Возврат Результат;

КонецФункции

// Заполняет список "кто вообще будет подписывать" — чтобы человек мог подписать заранее.
//
Процедура ЗаполнитьПредварительныеВизы(ДокОбъект, МассивРолей)

	ДокОбъект.А_ПредварительныеВизы.Очистить();

	ПоПользователям = Новый Соответствие; // Пользователь -> Строка ролей

	Для Каждого Роль Из МассивРолей Цикл
		Для Каждого Пользователь Из ПолучитьМассивПользователей(ДокОбъект, Роль) Цикл
			Роли = ПоПользователям.Получить(Пользователь);
			Если Роли = Неопределено Тогда
				ПоПользователям.Вставить(Пользователь, Строка(Роль));
			Иначе
				ПоПользователям.Вставить(Пользователь, Роли + ", " + Строка(Роль));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Для Каждого КлючЗначение Из ПоПользователям Цикл
		Строка = ДокОбъект.А_ПредварительныеВизы.Добавить();
		Строка.Пользователь = КлючЗначение.Ключ;
		Строка.Роли         = Лев(КлючЗначение.Значение, 250);
		Строка.Утверждено   = Ложь;
	КонецЦикла;

КонецПроцедуры

// Если очередь наступила у того, кто уже подписал заранее — визируем за него автоматически.
//
Процедура ПрименитьПредварительныеВизы(ДокОбъект, Состояние)

	Подписанные = ДокОбъект.А_ПредварительныеВизы.НайтиСтроки(Новый Структура("Утверждено", Истина));

	Для Каждого Предвиза Из Подписанные Цикл

		Если ДокОбъект.А_ТекущиеВизирующие.Найти(Предвиза.Пользователь, "Пользователь") = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Допы = Новый Структура;
		Допы.Вставить("ТекущийПользователь", Предвиза.Пользователь);
		Допы.Вставить("ЭтоАвтоВиза", Истина);
		Допы.Вставить("ДатаВизы", Предвиза.ДатаУтверждения);
		Допы.Вставить("Виза_Причина", Предвиза.Комментарий);

		УстановитьСостояние(ДокОбъект, Состояние, Допы);

		Прервать;

	КонецЦикла;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Адресация и схемы (запросы проверены Python COM до переноса в BSL, Rule #-1)

// Пользователи, визирующие документ под указанной ролью.
// Учитывает адресацию (по подразделению / организации / направлению) и переадресацию (замещение).
//
Функция ПолучитьМассивПользователей(ДокОбъект, Роль) Экспорт

	Если НЕ ЗначениеЗаполнено(Роль) Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Пользователь КАК Пользователь1,
	|	ВЫБОР
	|		КОГДА Т.Переадресация
	|				И (Т.ПереадресацияДо >= &Дата ИЛИ Т.ПереадресацияДо = ДАТАВРЕМЯ(1, 1, 1))
	|				И (Т.ПереадресацияС  <= &Дата ИЛИ Т.ПереадресацияС  = ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА Т.Переадресант
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	КОНЕЦ КАК Пользователь2
	|ПОМЕСТИТЬ Т_Данные
	|ИЗ
	|	РегистрСведений.А_ИдентификацияВизирующихПоРолям КАК Т
	|ГДЕ
	|	Т.Роль = &Роль
	|	И (Т.Роль.ВидАдресации = ЗНАЧЕНИЕ(Перечисление.А_ВидыАдресацииРолейВизирования.ПоПодразделению)
	|			И Т.Объект В (&Подразделения)
	|		ИЛИ Т.Роль.ВидАдресации = ЗНАЧЕНИЕ(Перечисление.А_ВидыАдресацииРолейВизирования.ПоОрганизации)
	|			И Т.Объект В (&Организации)
	|		ИЛИ Т.Роль.ВидАдресации = ЗНАЧЕНИЕ(Перечисление.А_ВидыАдресацииРолейВизирования.ПоНаправлению)
	|			И Т.Объект В (&Направления))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Пользователь1 КАК Пользователь
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т_Данные.Пользователь1 КАК Пользователь1
	|	ИЗ
	|		Т_Данные КАК Т_Данные
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Т_Данные.Пользователь2
	|	ИЗ
	|		Т_Данные КАК Т_Данные) КАК Т
	|ГДЕ
	|	Т.Пользователь1 <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";

	Запрос.УстановитьПараметр("Роль", Роль);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Подразделения",
		МассивПоИерархииВверх(ДокОбъект.Подразделение, Справочники.СтруктураПредприятия.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Организации",
		МассивСоЗначениемИПустым(ДокОбъект.Организация, Справочники.Организации.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Направления",
		МассивСоЗначениемИПустым(ДокОбъект.НаправлениеДеятельности, Справочники.НаправленияДеятельности.ПустаяСсылка()));

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");

КонецФункции

// Подбирает схему визирования по реквизитам заказа.
//
// Специфичность считается В BSL, а не в запросе: "Глубина" опирается на Уровень(),
// который в языке запросов недоступен. Формула Казны (СтрДлина(ПолныйКод())) непригодна —
// см. комментарий к ГлубинаИзмерения().
//
Функция ПолучитьСхемуВизирования(ДокОбъект) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.СхемаВизирования КАК СхемаВизирования,
	|	Т.Подразделение    КАК Подразделение,
	|	Т.Организация      КАК Организация,
	|	Т.СтатьяДвиженияДенежныхСредств КАК СтатьяДДС,
	|	Т.ФормаОплаты      КАК ФормаОплаты,
	|	Т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Т.Сумма            КАК Сумма,
	|	Т.Приоритет        КАК ПриоритетСхемы
	|ИЗ
	|	РегистрСведений.А_ОпределениеСхемыВизирования КАК Т
	|ГДЕ
	|	Т.Подразделение В (&Подразделения)
	|	И Т.Организация В (&Организации)
	|	И Т.СтатьяДвиженияДенежныхСредств В (&СтатьиДДС)
	|	И Т.ФормаОплаты В (&ФормыОплаты)
	|	И Т.НаправлениеДеятельности В (&Направления)
	|	И Т.Сумма <= &Сумма
	|	И Т.СхемаВизирования <> ЗНАЧЕНИЕ(Справочник.А_СхемыВизирования.ПустаяСсылка)";

	Запрос.УстановитьПараметр("Подразделения",
		МассивПоИерархииВверх(ДокОбъект.Подразделение, Справочники.СтруктураПредприятия.ПустаяСсылка()));
	Запрос.УстановитьПараметр("СтатьиДДС",
		МассивПоИерархииВверх(ДокОбъект.А_СтатьяДвиженияДенежныхСредств, Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Организации",
		МассивСоЗначениемИПустым(ДокОбъект.Организация, Справочники.Организации.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Направления",
		МассивСоЗначениемИПустым(ДокОбъект.НаправлениеДеятельности, Справочники.НаправленияДеятельности.ПустаяСсылка()));
	Запрос.УстановитьПараметр("ФормыОплаты",
		МассивСоЗначениемИПустым(ДокОбъект.ФормаОплаты, Перечисления.ФормыОплаты.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Сумма", ДокОбъект.СуммаДокумента);

	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 0 Тогда
		Возврат Справочники.А_СхемыВизирования.ПустаяСсылка();
	КонецЕсли;

	Таблица.Колонки.Добавить("Глубина", Новый ОписаниеТипов("Число"));
	Для Каждого Строка Из Таблица Цикл
		Строка.Глубина = 1000 + ГлубинаИзмерения(Строка.СтатьяДДС) + ГлубинаИзмерения(Строка.Подразделение);
	КонецЦикла;

	// Чем специфичнее правило — тем оно приоритетнее.
	// НаправлениеДеятельности в "Глубину" не входит: справочник плоский, вклад был бы константой.
	Таблица.Сортировать("ПриоритетСхемы Возр, Глубина Убыв, Сумма Убыв, Организация Убыв, ФормаОплаты Убыв");

	Возврат Таблица[0].СхемаВизирования;

КонецФункции

// Упорядоченный маршрут ролей по схеме.
//
Функция ПолучитьМассивРолейПоСхеме(Схема) Экспорт

	Если НЕ ЗначениеЗаполнено(Схема) Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Роль КАК Роль,
	|	Т.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Справочник.А_СхемыВизирования.Роли КАК Т
	|ГДЕ
	|	Т.Ссылка = &Схема
	|	И Т.Роль <> ЗНАЧЕНИЕ(Справочник.А_РолиВизирования.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	Запрос.УстановитьПараметр("Схема", Схема);

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Роль");

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Чтение данных визы документа

// Данные визы по ссылке (для ДоступныеСостояния и пакетного движка).
//
Функция ДанныеВизыДокумента(ДокСсылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Автор КАК Автор,
	|	Т.Менеджер КАК Менеджер,
	|	Т.А_Виза_Состояние КАК Состояние,
	|	Т.А_Виза_ТекущаяРоль КАК ТекущаяРоль,
	|	Т.Статус КАК Статус
	|ИЗ
	|	Документ.ЗаказПоставщику КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТВ.Пользователь КАК Пользователь
	|ИЗ
	|	Документ.ЗаказПоставщику.А_ТекущиеВизирующие КАК ТВ
	|ГДЕ
	|	ТВ.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПВ.Пользователь КАК Пользователь,
	|	ПВ.Утверждено КАК Утверждено
	|ИЗ
	|	Документ.ЗаказПоставщику.А_ПредварительныеВизы КАК ПВ
	|ГДЕ
	|	ПВ.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);

	Пакет = Запрос.ВыполнитьПакет();

	Шапка = Пакет[0].Выгрузить();
	Если Шапка.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Результат = Новый Структура("Автор, Менеджер, Состояние, ТекущаяРоль, Статус");
	ЗаполнитьЗначенияСвойств(Результат, Шапка[0]);
	Результат.Вставить("ТекущиеВизирующие",   Пакет[1].Выгрузить());
	Результат.Вставить("ПредварительныеВизы", Пакет[2].Выгрузить());

	Возврат Результат;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Вспомогательное

Процедура ДобавитьСостояние(Список, Состояние, Представление)

	Если Список.НайтиПоЗначению(Состояние) = Неопределено Тогда
		Список.Добавить(Состояние, Представление);
	КонецЕсли;

КонецПроцедуры

// Мера специфичности измерения при выборе схемы визирования.
//
// ВАЖНО. Формула Казны (СтрДлина(Ссылка.ПолныйКод())) здесь НЕ ГОДИТСЯ:
//  - на пустой ссылке ПолныйКод() бросает исключение "Элемент не выбран!";
//  - длина кода не монотонна по уровню иерархии, из-за чего БОЛЕЕ ОБЩЕЕ правило получало
//    больший вес, чем более частное, и документ уходил по чужой схеме (проверено на 847 элементах).
// Уровень() монотонен по определению.
//
Функция ГлубинаИзмерения(Ссылка) Экспорт

	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат 0;
	КонецЕсли;

	Возврат 100 + 10 * Ссылка.Уровень();

КонецФункции

// Разворачивает иерархию вверх: сам элемент, его родители, затем пустая ссылка ("любой").
//
Функция МассивПоИерархииВверх(Знач Ссылка, ПустаяСсылка) Экспорт

	Результат = Новый Массив;

	Пока ЗначениеЗаполнено(Ссылка) Цикл
		Результат.Добавить(Ссылка);
		Ссылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Родитель");
	КонецЦикла;

	Результат.Добавить(ПустаяСсылка);

	Возврат Результат;

КонецФункции

// Массив из значения и "любого" (пустого) — для условий вида Т.Измерение В (&Массив).
//
Функция МассивСоЗначениемИПустым(Значение, ПустоеЗначение) Экспорт

	Результат = Новый Массив;

	Если ЗначениеЗаполнено(Значение) Тогда
		Результат.Добавить(Значение);
	КонецЕсли;
	Результат.Добавить(ПустоеЗначение);

	Возврат Результат;

КонецФункции

#КонецОбласти
